#include <iostream>

/* Задача 1. Координатная плоскость.
Напишите программу, которая принимает на вход координаты X, 
Y некоторой точки на плоскости и отвечает, в какой четверти 
плоскости лежит эта точка (а если она лежит на границе двух 
четвертей — то так и отвечает “на границе”). Напомним, что 
четверти на плоскости нумеруются так: первая четверть — если 
обе координаты положительны, вторая — если X отрицателен, 
а Y положителен, третья — если обе координаты отрицательны, 
четвертая — если X положителен, а Y отрицателен. 
Точка лежит на границе четвертей, если хотя бы какая-то 
из ее координат равна нулю.*/

void task1() {
	//int product1 = 0;
	//int product2 = 0;
	//int product3 = 0;

	//std::cout << "This program can calculate discount for you";
	//std::cout << "Give me coast of the first product: ";
	//std::cin >> product1;
	//std::cout << "Give me coast of the second product: ";
	//std::cin >> product2;
	//std::cout << "Give me coast of the third product: ";
	//std::cin >> product3;

	//int receipt = product1 + product2 + product3;

	//if (receipt > 10000) {
	//	receipt *= 0.9;
	//}
	//
	//std::cout << "The receipt amount is: " << receipt;

}

