#include <iostream>

/* Задача 2. Банкомат.
Пользователи банкомата хотят снимать деньги. 
Но банкомат умеет выдавать только купюры по 100 рублей, 
а максимальная сумма снятия — 100 000 рублей.
Напишите программу, которая проверяет допустимость 
суммы средств, введенной пользователем.*/

void task2() {
	//int product1 = 0;
	//int product2 = 0;
	//int product3 = 0;

	//std::cout << "This program can calculate discount for you";
	//std::cout << "Give me coast of the first product: ";
	//std::cin >> product1;
	//std::cout << "Give me coast of the second product: ";
	//std::cin >> product2;
	//std::cout << "Give me coast of the third product: ";
	//std::cin >> product3;

	//int receipt = product1 + product2 + product3;

	//if (receipt > 10000) {
	//	receipt *= 0.9;
	//}
	//
	//std::cout << "The receipt amount is: " << receipt;

}

